Alright ! I think that i've misunderstood something, the "gke" module DO NOT create automatically Networks just by passing names to the module, i need to create them first by using something like this : 

```
module "gcp-network" {
  source       = "terraform-google-modules/network/google"
  version      = "~> 2.0"
  project_id   = var.project_id
  network_name = var.network

  subnets = [
    {
      subnet_name   = var.subnetwork
      subnet_ip     = "10.0.0.0/17"
      subnet_region = var.region
    },
  ]

  secondary_ranges = {
    "${var.subnetwork}" = [
      {
        range_name    = var.ip_range_pods
        ip_cidr_range = "192.168.0.0/18"
      },
      {
        range_name    = var.ip_range_services
        ip_cidr_range = "192.168.64.0/18"
      },
    ]
  }
}
```
Right ?

I tried to create a Shared VPC and a subnetwork directly on Google Cloud dashboard, and finally, using `terraform plan` gives me something like this : 

```
  # module.gke.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + default_max_pods_per_node   = 110
      + enable_binary_authorization = false
      + enable_intranode_visibility = false
      + enable_kubernetes_alpha     = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = false
      + enable_tpu                  = false
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "europe-west1"
      + logging_service             = "logging.googleapis.com/kubernetes"
      + master_version              = (known after apply)
      + min_master_version          = "1.15.8-gke.2"
      + monitoring_service          = "monitoring.googleapis.com/kubernetes"
      + name                        = "simple-regional-beta-cluster"
      + network                     = "https://www.googleapis.com/compute/beta/projects/fleeters-cloud/global/networks/test-network"
      + node_locations              = [
          + "europe-west1-b",
          + "europe-west1-c",
          + "europe-west1-d",
        ]
      + node_version                = (known after apply)
      + project                     = "fleeters-cloud"
      + remove_default_node_pool    = false
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "https://www.googleapis.com/compute/beta/projects/fleeters-cloud/regions/europe-west1/subnetworks/test-subnetwork"
      + tpu_ipv4_cidr_block         = (known after apply)
```
@morgante So to answer your question : 

 - I did create a Shared VPC directly into GCP Dashboard, now it shows up on `terraform plan`
 - I did create the subnetwork to the right region, and now it also shows up on `terraform plan`
 - Command output : 
```
# module.gke.data.google_compute_network.gke_network:
data "google_compute_network" "gke_network" {}
```
If i'm right for provisionning a functionnal GKE Cluster i need to do something like this : 

```
locals {
  cluster_type = "simple-regional-beta"
}

provider "google-beta" {
  version = "~> 3.3.0"
  region  = var.region
}

module "gcp-network" {
  source       = "terraform-google-modules/network/google"
  version      = "~> 2.0"
  project_id   = var.project_id
  network_name = var.network

  subnets = [
    {
      subnet_name   = var.subnetwork
      subnet_ip     = "10.0.0.0/17"
      subnet_region = var.region
    },
  ]

  secondary_ranges = {
    "${var.subnetwork}" = [
      {
        range_name    = var.ip_range_pods
        ip_cidr_range = "192.168.0.0/18"
      },
      {
        range_name    = var.ip_range_services
        ip_cidr_range = "192.168.64.0/18"
      },
    ]
  }
}

module "gke" {
  source                      = "terraform-google-modules/kubernetes-engine/google//modules/beta-public-cluster"
  version                     = "7.0.0"
  project_id                  = var.project_id
  name                        = "${local.cluster_type}-cluster${var.cluster_name_suffix}"
  regional                    = var.regional
  region                      = var.region
  zones                       = var.zones
  network                     = var.network
  subnetwork                  = var.subnetwork
  ip_range_pods               = var.ip_range_pods
  ip_range_services           = var.ip_range_services
  create_service_account      = var.compute_engine_service_account == "create"
  istio                       = var.istio
  cloudrun                    = var.cloudrun
  node_metadata               = var.node_metadata
  sandbox_enabled             = var.sandbox_enabled
  remove_default_node_pool    = var.remove_default_node_pool
  node_pools                  = var.node_pools
  database_encryption         = var.database_encryption
  enable_binary_authorization = var.enable_binary_authorization
  pod_security_policy_config  = var.pod_security_policy_config
  release_channel             = "UNSPECIFIED"
}

data "google_client_config" "default" {
} 
```
Is that correct ? 
